characterCreator/app/controllers/characters_controller.rb

    def create
        @character = Character.new(character_params)

        if @character.save
            @race = Race.find_by_name(@character.race)
            @character.skillset = Skillset.create({:block => @race.block, :heavyArmor => @race.heavyArmor, :oneHanded => @race.oneHanded, :smithing => @race.smithing, :twoHanded => @race.twoHanded, :archery => @race.archery, :alchemy => @race.alchemy, :lightArmor => @race.lightArmor, :lockPicking => @race.lockPicking, :pickPocket => @race.pickPocket, :sneak => @race.sneak, :speech => @race.speech, :alteration => @race.alteration, :conjuration => @race.conjuration, :destruction => @race.destruction, :enchanting => @race.enchanting, :illusion => @race.illusion, :restoration => @race.illusion})
---
INSERT INTO "characters" ("name", "gender", "race", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["gender", "Man"], ["race", "khajit"], ["created_at", "2017-11-30 05:07:22.013089"], ["updated_at", "2017-11-30 05:07:22.013089"]]
SELECT  "races".* FROM "races" WHERE "races"."name" = ? LIMIT ?  [["name", "The Race With Level 99 Skills"], ["LIMIT", 1]]
INSERT INTO "skillsets" ("character_id", "block", "heavyArmor", "oneHanded", "smithing", "twoHanded", "archery", "alchemy", "lightArmor", "lockPicking", "pickPocket", "sneak", "speech", "alteration", "conjuration", "destruction", "enchanting", "illusion", "restoration", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def show
        @character = Character.find(params[:id])

        @race = Race.find_by_name(@character.race)
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "races".* FROM "races" WHERE "races"."name" = ? LIMIT ?  [["name", "test1"], ["LIMIT", 1]]

    def edit
        @character = Character.find(params[:id])
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def destroy
        @character = Character.find(params[:id])
        @character.destroy
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 1]]