characterCreator/app/controllers/races_controller.rb

SELECT "races".* FROM "races"
---
    def index
        @races = Race.all

INSERT INTO "races" ("name", "block", "heavyArmor", "oneHanded", "smithing", "twoHanded", "archery", "alchemy", "lightArmor", "lockPicking", "pickPocket", "sneak", "speech", "alteration", "conjuration", "destruction", "enchanting", "illusion", "restoration", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @race = Race.new(race_params)

        if @race.save

SELECT  "races".* FROM "races" WHERE "races"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @race = Race.find(params[:id])

SELECT  "races".* FROM "races" WHERE "races"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @race = Race.find(params[:id])

SELECT  "races".* FROM "races" WHERE "races"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "races" SET "name" = ?, "updated_at" = ? WHERE "races"."id" = ?  [["name", "test3"], ["updated_at", "2017-12-04 16:33:07.801846"], ["id", 1]]
---
    def update
        @race = Race.find(params[:id])
        if @race.update(race_params)

SELECT  "races".* FROM "races" WHERE "races"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "races" WHERE "races"."id" = ?  [["id", 3]]
---
    def destroy
        @race = Race.find(params[:id])
        @race.destroy