characterCreator/app/controllers/skillsets_controller.rb

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    def edit
        @character = Character.find(params[:character_id])

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "skillsets" SET "block" = ?, "updated_at" = ? WHERE "skillsets"."id" = ?  [["block", 100], ["updated_at", "2017-12-13 20:09:30.832507"], ["id", 6]]
---
    def update
        @character = Character.find(params[:character_id])
        @skillset = @character.skillset

        if @skillset.update_attributes(params[:skillset])