characterCreator/app/views/skillsets/_form.html.erb

<%= form_for [@character, @character.skillset]  do |f| %>
    <% if @character.skillset.errors.any? %>
---
SELECT  "skillsets".* FROM "skillsets" WHERE "skillsets"."character_id" = ? LIMIT ?  [["character_id", 12], ["LIMIT", 1]]