characterCreator/app/views/characters/_form.html.erb

  <%= f.label :race, 'race' , class: "formText"%>
  <%= f.collection_select :race, Race.all, :name, :name , class: "formText"%>
---
SELECT "races"."name" FROM "races"